delegator/delavnica.org
#+TITLE: Handout za Delegator delavnico
#+OPTIONS: toc :3

* Uvod
* PHP osnove
** Splošno
    - dokaj C-jevska sintaksa (sicer enostavnejša)
    - .php datoteko začnemo s <?php tagom, opcionalno zaključimo z ?>

      #+BEGIN_SRC php
      <?php
            program;
            in_to;
      ?>
      #+END_SRC

    - { } za definicije blokov (funkcij, teles kontrolnih struktur...)
    - ; konec stavkov
      
      #+BEGIN_SRC php
      klic_funkcije();
      #+END_SRC

    - Komentarji

      #+BEGIN_SRC php
      koda; // Enovrstični komentar
      /*
          večvrstični
          komentar
      */
      #+END_SRC

    - include "imedatoteke.php";

      Include vključi (požene) kodo iz poljubne datoteke

    - Konfiguracija v php.ini
    - Obstaja zelo veliko modulov
** Podatkovne strukture
*** Skalarni tip (spremenljvika z eno vrednostjo)

     #+BEGIN_SRC php
     $spremenljivka = "vrednost";
     #+END_SRC

     #+BEGIN_SRC php
     echo($spremenljivka); // "vrednost"
     #+END_SRC

**** Tipi skalarjev
      - Besedilo (string)

        #+BEGIN_SRC php
        'Dobeseden tekst', "Tekst s spremenljivko: $stevilo"
        #+END_SRC

      - Število (integer) - celo število

        #+BEGIN_SRC php
        0, 42, -123 ...
        #+END_SRC

      - Decimalno število (float)

        #+BEGIN_SRC php
        0.5, -12.952 ...
        #+END_SRC

      - Binarna vrednost (boolean)

        #+BEGIN_SRC php
        true / false
        #+END_SRC

      - Ničelna vrednost

        #+BEGIN_SRC php
        null
        #+END_SRC
        
      - V skalar lahko tudi shranimo funkcijo

        #+BEGIN_SRC php
        $opravilo = function() {
            izvedi;
        }
        $opravilo();
        #+END_SRC
*** Konstante
     - nespremenljive

       #+BEGIN_SRC php
       define("IMEKONSTANTE", vrednost);
       echo(IMEKONSTANTE); // vrednost
       #+END_SRC
*** Polje (array)
    - Vsebuje zaporeden seznam vrednosti kateregakoli tipa (kot pri skalarjih)
    - Dostop do elementov z zaporednim številom, začenši z 0

      #+BEGIN_SRC php
      $polje = [1, "dva", 3];
      $polje = array(1, "dva", 3);
      echo($polje[1]); // 1
      echo($polje[2]); // "dva"
      #+END_SRC
*** Asociativno polje (associative array)
     - Seznam vrednosti, indeksiran z vrednostmi kateregakoli tipa

     #+BEGIN_SRC php
     $asociativno_polje = array(
           "kljuc" => "vrednost!",
           1001 => true
     );
     $asociativno_polje = [
           "kljuc" => "vrednost!",
           1001 => true
     ];
     echo($asociativno_polje["kljuc"]); // "vrednost!"
     echo($asociativno_polje[1001]); // true
     #+END_SRC

*** Posebne spremenljivke
    - $_GET

      Vsebuje asociativno polje parametrov, podanih preko naslova.

      Primer:http://stran.domena.si/skripta.php?stran=1&objekt=streha
      #+BEGIN_SRC php
      [
          "stran" => "1",
          "objekt" => "streha"
      ]
      #+END_SRC

    - $_POST

      Vsebuje POST podatke, ki se pošljejo kadar oddamo obrazec (form), pri
      nalaganju datotek itd.

    - $_SERVER

      Seznam raznih podatkov o strežniku

    - $_REQUEST

      Seznam podatkov oddanega obrazca (najdemo jih tudi v POST, ampak so tam
      lahko še kakšni drugi)

    - $_SESSION

      Vsebuje seznam vrednosti seje (session), ki služi ohranjanju istih
      podatkov posameznega uporabnika, med večimi zahtevki
      
    - $_ENV

      Okoljske spremenljivke sistema (če je omogočeno v konfiguraciji)
      
    - $_COOKIE

      Podatki piškotka uporabnika. Piškotki so malo podobni seji, vendar se
      njihovi podatki ne hranji na strežniku, temveč v brskalniku uporabnika
      samega

    - $_FILES

      Asociativno polje, ki vsebuje datoteke, naložene s POST zahtevkom

** Operatorji
