delegator/delavnica.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Handout za Delegator delavnico</title>
<!-- 2015-04-19 Sun 14:34 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="len" />
</head>
<body>
<div id="content">
<h1 class="title">Handout za Delegator delavnico</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Uvod</a></li>
<li><a href="#sec-2">2. PHP osnove</a>
<ul>
<li><a href="#sec-2-1">2.1. Splošno</a></li>
<li><a href="#sec-2-2">2.2. Podatkovne strukture</a>
<ul>
<li><a href="#sec-2-2-1">2.2.1. Skalarni tip (spremenljvika z eno vrednostjo)</a></li>
<li><a href="#sec-2-2-2">2.2.2. Konstante</a></li>
<li><a href="#sec-2-2-3">2.2.3. Polje (array)</a></li>
<li><a href="#sec-2-2-4">2.2.4. Asociativno polje (associative array)</a></li>
<li><a href="#sec-2-2-5">2.2.5. Posebne spremenljivke</a></li>
</ul>
</li>
<li><a href="#sec-2-3">2.3. Operatorji</a>
<ul>
<li><a href="#sec-2-3-1">2.3.1. Aritmetični</a></li>
<li><a href="#sec-2-3-2">2.3.2. Določitveni</a></li>
<li><a href="#sec-2-3-3">2.3.3. Primerjalni</a></li>
<li><a href="#sec-2-3-4">2.3.4. Logiški</a></li>
</ul>
</li>
<li><a href="#sec-2-4">2.4. Kontrolne strukture</a>
<ul>
<li><a href="#sec-2-4-1">2.4.1. If stavki</a></li>
<li><a href="#sec-2-4-2">2.4.2. While zanke</a></li>
<li><a href="#sec-2-4-3">2.4.3. For zanke</a></li>
<li><a href="#sec-2-4-4">2.4.4. Switch stavek</a></li>
</ul>
</li>
<li><a href="#sec-2-5">2.5. Funkcije</a></li>
<li><a href="#sec-2-6">2.6. Seznam primerov raznih PHP funkcij</a></li>
</ul>
</li>
<li><a href="#sec-3">3. git</a>
<ul>
<li><a href="#sec-3-1">3.1. Začetni ukazi</a>
<ul>
<li><a href="#sec-3-1-1">3.1.1. Shranjevanje</a></li>
<li><a href="#sec-3-1-2">3.1.2. Pregledovanje arhiva</a></li>
<li><a href="#sec-3-1-3">3.1.3. Razveljavljanje sprememb <i>(ne znam)</i></a></li>
</ul>
</li>
<li><a href="#sec-3-2">3.2. Sodelovanje</a>
<ul>
<li><a href="#sec-3-2-1">3.2.1. Porivanje in vlečenje</a></li>
<li><a href="#sec-3-2-2">3.2.2. Veje</a></li>
<li><a href="#sec-3-2-3">3.2.3. Delovni proces</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-4">4. SMF</a>
<ul>
<li><a href="#sec-4-1">4.1. Spremenljivke</a></li>
<li><a href="#sec-4-2">4.2. Seznam SMF funkcij</a></li>
<li><a href="#sec-4-3">4.3. Struktura Moda</a>
<ul>
<li><a href="#sec-4-3-1">4.3.1. Povezave</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Uvod</h2>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> PHP osnove</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Splošno</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>dokaj C-jevska sintaksa (sicer enostavnejša)
</li>
<li>.php datoteko začnemo s &lt;?php tagom, opcionalno zaključimo z ?&gt;

<div class="org-src-container">

<pre class="src src-php"><span style="color: #919191;">&lt;?php</span>
      program;
      in_to;
<span style="color: #919191;">?&gt;</span>
</pre>
</div>
</li>

<li>{ } za definicije blokov (funkcij, teles kontrolnih struktur&#x2026;)
</li>
<li>; konec stavkov

<div class="org-src-container">

<pre class="src src-php">klic_funkcije();
</pre>
</div>
</li>

<li>Komentarji

<div class="org-src-container">

<pre class="src src-php">koda; <span style="color: #8e908c; font-style: italic;">// </span><span style="color: #8B8989; font-style: italic;">Enovrsti&#269;ni komentar</span>
<span style="color: #8e908c; font-style: italic;">/*</span>
<span style="color: #8B8989; font-style: italic;">    ve&#269;vrsti&#269;ni</span>
<span style="color: #8B8989; font-style: italic;">    komentar</span>
<span style="color: #8B8989; font-style: italic;">*/</span>
</pre>
</div>
</li>

<li>include "imedatoteke.php";

<p>
Include vključi (požene) kodo iz poljubne datoteke
</p>
</li>

<li>Konfiguracija v php.ini
</li>
<li>Obstaja zelo veliko modulov
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Podatkovne strukture</h3>
<div class="outline-text-3" id="text-2-2">
</div><div id="outline-container-sec-2-2-1" class="outline-4">
<h4 id="sec-2-2-1"><span class="section-number-4">2.2.1</span> Skalarni tip (spremenljvika z eno vrednostjo)</h4>
<div class="outline-text-4" id="text-2-2-1">
<div class="org-src-container">

<pre class="src src-php"><span style="color: #d3d3d3; background-color: #000000;">$</span><span style="color: #D8FA3C;">spremenljivka</span> = <span style="color: #61CE3C;">"vrednost"</span>;
</pre>
</div>

<div class="org-src-container">

<pre class="src src-php"><span style="color: #FBDE2D;">echo</span>(<span style="color: #d3d3d3; background-color: #000000;">$</span><span style="color: #D8FA3C;">spremenljivka</span>); <span style="color: #8e908c; font-style: italic;">// </span><span style="color: #8B8989; font-style: italic;">"vrednost"</span>
</pre>
</div>
</div>

<ol class="org-ol"><li><a id="sec-2-2-1-1" name="sec-2-2-1-1"></a>Tipi skalarjev<br  /><div class="outline-text-5" id="text-2-2-1-1">
<ul class="org-ul">
<li>Besedilo (string)

<div class="org-src-container">

<pre class="src src-php"><span style="color: #61CE3C;">'Dobeseden tekst'</span>, <span style="color: #61CE3C;">"Tekst s spremenljivko: </span><span style="color: #D8FA3C;">$stevilo</span><span style="color: #61CE3C;">"</span>
</pre>
</div>
</li>

<li>Število (integer) - celo število

<div class="org-src-container">

<pre class="src src-php">0, 42, -123 ...
</pre>
</div>
</li>

<li>Decimalno število (float)

<div class="org-src-container">

<pre class="src src-php">0.5, -12.952 ...
</pre>
</div>
</li>

<li>Binarna vrednost (boolean)

<div class="org-src-container">

<pre class="src src-php"><span style="color: #4c83ff;">true</span> / <span style="color: #4c83ff;">false</span>
</pre>
</div>
</li>

<li>Ničelna vrednost

<div class="org-src-container">

<pre class="src src-php"><span style="color: #4c83ff;">null</span>
</pre>
</div>
</li>

<li>V skalar lahko tudi shranimo funkcijo

<div class="org-src-container">

<pre class="src src-php"><span style="color: #d3d3d3; background-color: #000000;">$</span><span style="color: #D8FA3C;">opravilo</span> = <span style="color: #FBDE2D;">function</span>() {
    izvedi;
}
<span style="color: #d3d3d3; background-color: #000000;">$</span><span style="color: #D8FA3C;">opravilo</span>();
</pre>
</div>
</li>
</ul>
</div>
</li></ol>
</div>
<div id="outline-container-sec-2-2-2" class="outline-4">
<h4 id="sec-2-2-2"><span class="section-number-4">2.2.2</span> Konstante</h4>
<div class="outline-text-4" id="text-2-2-2">
<ul class="org-ul">
<li>nespremenljive

<div class="org-src-container">

<pre class="src src-php">define(<span style="color: #61CE3C;">"IMEKONSTANTE"</span>, vrednost);
<span style="color: #FBDE2D;">echo</span>(<span style="color: #4c83ff;">IMEKONSTANTE</span>); <span style="color: #8e908c; font-style: italic;">// </span><span style="color: #8B8989; font-style: italic;">vrednost</span>
</pre>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2-2-3" class="outline-4">
<h4 id="sec-2-2-3"><span class="section-number-4">2.2.3</span> Polje (array)</h4>
<div class="outline-text-4" id="text-2-2-3">
<ul class="org-ul">
<li>Vsebuje zaporeden seznam vrednosti kateregakoli tipa (kot pri skalarjih)
</li>
<li>Dostop do elementov z zaporednim številom, začenši z 0

<div class="org-src-container">

<pre class="src src-php"><span style="color: #d3d3d3; background-color: #000000;">$</span><span style="color: #D8FA3C;">polje</span> = [1, <span style="color: #61CE3C;">"dva"</span>, 3];
<span style="color: #d3d3d3; background-color: #000000;">$</span><span style="color: #D8FA3C;">polje</span> = <span style="color: #FBDE2D;">array</span>(1, <span style="color: #61CE3C;">"dva"</span>, 3);
<span style="color: #FBDE2D;">echo</span>(<span style="color: #d3d3d3; background-color: #000000;">$</span><span style="color: #D8FA3C;">polje</span>[1]); <span style="color: #8e908c; font-style: italic;">// </span><span style="color: #8B8989; font-style: italic;">1</span>
<span style="color: #FBDE2D;">echo</span>(<span style="color: #d3d3d3; background-color: #000000;">$</span><span style="color: #D8FA3C;">polje</span>[2]); <span style="color: #8e908c; font-style: italic;">// </span><span style="color: #8B8989; font-style: italic;">"dva"</span>
</pre>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2-2-4" class="outline-4">
<h4 id="sec-2-2-4"><span class="section-number-4">2.2.4</span> Asociativno polje (associative array)</h4>
<div class="outline-text-4" id="text-2-2-4">
<ul class="org-ul">
<li>Seznam vrednosti, indeksiran z vrednostmi kateregakoli tipa
</li>
</ul>

<div class="org-src-container">

<pre class="src src-php"><span style="color: #d3d3d3; background-color: #000000;">$</span><span style="color: #D8FA3C;">asociativno_polje</span> = <span style="color: #FBDE2D;">array</span>(
      <span style="color: #61CE3C;">"kljuc"</span> =&gt; <span style="color: #61CE3C;">"vrednost!"</span>,
      1001 =&gt; <span style="color: #4c83ff;">true</span>
);
<span style="color: #d3d3d3; background-color: #000000;">$</span><span style="color: #D8FA3C;">asociativno_polje</span> = [
      <span style="color: #61CE3C;">"kljuc"</span> =&gt; <span style="color: #61CE3C;">"vrednost!"</span>,
      1001 =&gt; <span style="color: #4c83ff;">true</span>
];
<span style="color: #FBDE2D;">echo</span>(<span style="color: #d3d3d3; background-color: #000000;">$</span><span style="color: #D8FA3C;">asociativno_polje</span>[<span style="color: #61CE3C;">"kljuc"</span>]); <span style="color: #8e908c; font-style: italic;">// </span><span style="color: #8B8989; font-style: italic;">"vrednost!"</span>
<span style="color: #FBDE2D;">echo</span>(<span style="color: #d3d3d3; background-color: #000000;">$</span><span style="color: #D8FA3C;">asociativno_polje</span>[1001]); <span style="color: #8e908c; font-style: italic;">// </span><span style="color: #8B8989; font-style: italic;">true</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-2-5" class="outline-4">
<h4 id="sec-2-2-5"><span class="section-number-4">2.2.5</span> Posebne spremenljivke</h4>
<div class="outline-text-4" id="text-2-2-5">
<ul class="org-ul">
<li>$<sub>GET</sub>

<p>
Vsebuje asociativno polje parametrov, podanih preko naslova.
</p>

<p>
Primer:<a href="http://stran.domena.si/skripta.php?stran=1&objekt=streha">http://stran.domena.si/skripta.php?stran=1&objekt=streha</a>
</p>
<div class="org-src-container">

<pre class="src src-php">[
    <span style="color: #61CE3C;">"stran"</span> =&gt; <span style="color: #61CE3C;">"1"</span>,
    <span style="color: #61CE3C;">"objekt"</span> =&gt; <span style="color: #61CE3C;">"streha"</span>
]
</pre>
</div>
</li>

<li>$<sub>POST</sub>

<p>
Vsebuje POST podatke, ki se pošljejo kadar oddamo obrazec (form), pri
nalaganju datotek itd.
</p>
</li>

<li>$<sub>SERVER</sub>

<p>
Seznam raznih podatkov o strežniku
</p>
</li>

<li>$<sub>REQUEST</sub>

<p>
Seznam podatkov oddanega obrazca (najdemo jih tudi v POST, ampak so tam
lahko še kakšni drugi)
</p>
</li>

<li>$<sub>SESSION</sub>

<p>
Vsebuje seznam vrednosti seje (session), ki služi ohranjanju istih
podatkov posameznega uporabnika, med večimi zahtevki
</p>
</li>

<li>$<sub>ENV</sub>

<p>
Okoljske spremenljivke sistema (če je omogočeno v konfiguraciji)
</p>
</li>

<li>$<sub>COOKIE</sub>

<p>
Podatki piškotka uporabnika. Piškotki so malo podobni seji, vendar se
njihovi podatki ne hranji na strežniku, temveč v brskalniku uporabnika
samega
</p>
</li>

<li>$<sub>FILES</sub>

<p>
Asociativno polje, ki vsebuje datoteke, naložene s POST zahtevkom
</p>
</li>
</ul>
</div>
</div>
</div>
