delegator/delavnica.org
*** Aritmetični
    #+BEGIN_SRC php
    1 + 3  // 8
    1 - 1  // 0
    2 * 5  // 10
    8 / 4  // 2
    10 % 4 // 2
    2**3   // 8
    #+END_SRC

*** Določitveni
    #+BEGIN_SRC php
    $blah = "tekst";
    $st += 1;
    $test -= 4;
    $num *= 2;
    $N /= 3;
    $veliko %= 5;
    "eno" . " in " . " drugo" // "eno in drugo"
    $tekst = "Pozdravljen";
    $tekst .+ ", svet!"; // "Pozdravljen, svet!"
    #+END_SRC
     
*** Primerjalni
    #+BEGIN_SRC php
    1 == 2         // false
    null == 0      // true
    false == null  // true
    4 != 4         // false
    8 != "test"    // true
    2 <> 7         // true

    0 === null     // false
    null !== false // true

    6 < 7          // true
    9 > 27         // false

    3 >= 1         // false
    7 >= 5 + 2     // true
    #+END_SRC

*** Logiški
    #+BEGIN_SRC php
    1 && 0          // false
    false and false // true

    1 || 0          // true
    false or 0      // false

    true xor true   // false
    0 xor true      // true

    !true           // false
    #+END_SRC

** Kontrolne strukture
*** If stavki
     #+BEGIN_SRC php
     if (pogoj) posledica else drugaposledica;
     #+END_SRC

     #+BEGIN_SRC php
     if (pogoj) {
         posledica;
     } elseif (drugpogoj) {
         drugaposledica;
     } else {
         nekajtretjega;
     }
     #+END_SRC

     #+BEGIN_SRC php
     if (pogoj):
         razne;
         stvari;
     else:
         drugo;
     endif;
     #+END_SRC

*** While zanke
     #+BEGIN_SRC php
     while (pogoj) {
         ponavljaj;
     }
     #+END_SRC
     
     #+BEGIN_SRC php
     do {
         ponavljaj;
     } while (pogoj);
     #+END_SRC

     #+BEGIN_SRC php
     while (pogoj):
         ponavljaj;
     endwhile;
     #+END_SRC

*** For zanke
     #+BEGIN_SRC php
     for ($i = 0; $i < 3; $i++) {
         ponovi;     // Ponovi 3x
     }
     #+END_SRC

     #+BEGIN_SRC php
     $stevec = [1, 2, 3, 4];
     foreach ($stevec as $stevilo) {
         echo("$stevilo!\n");
     }
     #+END_SRC

     #+BEGIN_SRC php
     $polje = [
         "kljuc" => "vrednost",
         "drugo" => "tretje"
     ];
     foreach ($polje as $kljuc => $vrednost) {
         echo("vrednost " . $kljuc . ": " . $vrednost . "\n");
     }
     #+END_SRC

*** Switch stavek
    - Podoben if / elseif / else, ampak nekoliko berljivejši

    #+BEGIN_SRC php
    switch ($spremenljivka) {
        case 1:
            narediNekaj();
            break;
        case "drugo":
            drug_primer();
            break;
        default:
            privzeto();
    }
    #+END_SRC

