delegator/delavnica.html

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Operatorji</h3>
<div class="outline-text-3" id="text-2-3">
</div><div id="outline-container-sec-2-3-1" class="outline-4">
<h4 id="sec-2-3-1"><span class="section-number-4">2.3.1</span> Aritmetični</h4>
<div class="outline-text-4" id="text-2-3-1">
<div class="org-src-container">

<pre class="src src-php">1 + 3  <span style="color: #8e908c; font-style: italic;">// </span><span style="color: #8B8989; font-style: italic;">8</span>
1 - 1  <span style="color: #8e908c; font-style: italic;">// </span><span style="color: #8B8989; font-style: italic;">0</span>
2 * 5  <span style="color: #8e908c; font-style: italic;">// </span><span style="color: #8B8989; font-style: italic;">10</span>
8 / 4  <span style="color: #8e908c; font-style: italic;">// </span><span style="color: #8B8989; font-style: italic;">2</span>
10 % 4 <span style="color: #8e908c; font-style: italic;">// </span><span style="color: #8B8989; font-style: italic;">2</span>
2**3   <span style="color: #8e908c; font-style: italic;">// </span><span style="color: #8B8989; font-style: italic;">8</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-3-2" class="outline-4">
<h4 id="sec-2-3-2"><span class="section-number-4">2.3.2</span> Določitveni</h4>
<div class="outline-text-4" id="text-2-3-2">
<div class="org-src-container">

<pre class="src src-php"><span style="color: #d3d3d3; background-color: #000000;">$</span><span style="color: #D8FA3C;">blah</span> = <span style="color: #61CE3C;">"tekst"</span>;
<span style="color: #d3d3d3; background-color: #000000;">$</span><span style="color: #D8FA3C;">st</span> += 1;
<span style="color: #d3d3d3; background-color: #000000;">$</span><span style="color: #D8FA3C;">test</span> -= 4;
<span style="color: #d3d3d3; background-color: #000000;">$</span><span style="color: #D8FA3C;">num</span> *= 2;
<span style="color: #d3d3d3; background-color: #000000;">$</span><span style="color: #D8FA3C;">N</span> /= 3;
<span style="color: #d3d3d3; background-color: #000000;">$</span><span style="color: #D8FA3C;">veliko</span> %= 5;
<span style="color: #61CE3C;">"eno"</span> . <span style="color: #61CE3C;">" in "</span> . <span style="color: #61CE3C;">" drugo"</span> <span style="color: #8e908c; font-style: italic;">// </span><span style="color: #8B8989; font-style: italic;">"eno in drugo"</span>
<span style="color: #d3d3d3; background-color: #000000;">$</span><span style="color: #D8FA3C;">tekst</span> = <span style="color: #61CE3C;">"Pozdravljen"</span>;
<span style="color: #d3d3d3; background-color: #000000;">$</span><span style="color: #D8FA3C;">tekst</span> .+ <span style="color: #61CE3C;">", svet!"</span>; <span style="color: #8e908c; font-style: italic;">// </span><span style="color: #8B8989; font-style: italic;">"Pozdravljen, svet!"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-3-3" class="outline-4">
<h4 id="sec-2-3-3"><span class="section-number-4">2.3.3</span> Primerjalni</h4>
<div class="outline-text-4" id="text-2-3-3">
<div class="org-src-container">

<pre class="src src-php">1 == 2         <span style="color: #8e908c; font-style: italic;">// </span><span style="color: #8B8989; font-style: italic;">false</span>
<span style="color: #4c83ff;">null</span> == 0      <span style="color: #8e908c; font-style: italic;">// </span><span style="color: #8B8989; font-style: italic;">true</span>
<span style="color: #4c83ff;">false</span> == <span style="color: #4c83ff;">null</span>  <span style="color: #8e908c; font-style: italic;">// </span><span style="color: #8B8989; font-style: italic;">true</span>
4 != 4         <span style="color: #8e908c; font-style: italic;">// </span><span style="color: #8B8989; font-style: italic;">false</span>
8 != <span style="color: #61CE3C;">"test"</span>    <span style="color: #8e908c; font-style: italic;">// </span><span style="color: #8B8989; font-style: italic;">true</span>
2 &lt;&gt; 7         <span style="color: #8e908c; font-style: italic;">// </span><span style="color: #8B8989; font-style: italic;">true</span>

0 === <span style="color: #4c83ff;">null</span>     <span style="color: #8e908c; font-style: italic;">// </span><span style="color: #8B8989; font-style: italic;">false</span>
<span style="color: #4c83ff;">null</span> !== <span style="color: #4c83ff;">false</span> <span style="color: #8e908c; font-style: italic;">// </span><span style="color: #8B8989; font-style: italic;">true</span>

6 &lt; 7          <span style="color: #8e908c; font-style: italic;">// </span><span style="color: #8B8989; font-style: italic;">true</span>
9 &gt; 27         <span style="color: #8e908c; font-style: italic;">// </span><span style="color: #8B8989; font-style: italic;">false</span>

3 &gt;= 1         <span style="color: #8e908c; font-style: italic;">// </span><span style="color: #8B8989; font-style: italic;">false</span>
7 &gt;= 5 + 2     <span style="color: #8e908c; font-style: italic;">// </span><span style="color: #8B8989; font-style: italic;">true</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-3-4" class="outline-4">
<h4 id="sec-2-3-4"><span class="section-number-4">2.3.4</span> Logiški</h4>
<div class="outline-text-4" id="text-2-3-4">
<div class="org-src-container">

<pre class="src src-php">1 &amp;&amp; 0          <span style="color: #8e908c; font-style: italic;">// </span><span style="color: #8B8989; font-style: italic;">false</span>
<span style="color: #4c83ff;">false</span> <span style="color: #FBDE2D;">and</span> <span style="color: #4c83ff;">false</span> <span style="color: #8e908c; font-style: italic;">// </span><span style="color: #8B8989; font-style: italic;">true</span>

1 || 0          <span style="color: #8e908c; font-style: italic;">// </span><span style="color: #8B8989; font-style: italic;">true</span>
<span style="color: #4c83ff;">false</span> <span style="color: #FBDE2D;">or</span> 0      <span style="color: #8e908c; font-style: italic;">// </span><span style="color: #8B8989; font-style: italic;">false</span>

<span style="color: #4c83ff;">true</span> <span style="color: #FBDE2D;">xor</span> <span style="color: #4c83ff;">true</span>   <span style="color: #8e908c; font-style: italic;">// </span><span style="color: #8B8989; font-style: italic;">false</span>
0 <span style="color: #FBDE2D;">xor</span> <span style="color: #4c83ff;">true</span>      <span style="color: #8e908c; font-style: italic;">// </span><span style="color: #8B8989; font-style: italic;">true</span>

<span style="color: #4271ae;">!</span><span style="color: #4c83ff;">true</span>           <span style="color: #8e908c; font-style: italic;">// </span><span style="color: #8B8989; font-style: italic;">false</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> Kontrolne strukture</h3>
<div class="outline-text-3" id="text-2-4">
</div><div id="outline-container-sec-2-4-1" class="outline-4">
<h4 id="sec-2-4-1"><span class="section-number-4">2.4.1</span> If stavki</h4>
<div class="outline-text-4" id="text-2-4-1">
<div class="org-src-container">

<pre class="src src-php"><span style="color: #FBDE2D;">if</span> (pogoj) posledica <span style="color: #FBDE2D;">else</span> drugaposledica;
</pre>
</div>

<div class="org-src-container">

<pre class="src src-php"><span style="color: #FBDE2D;">if</span> (pogoj) {
    posledica;
} <span style="color: #FBDE2D;">elseif</span> (drugpogoj) {
    drugaposledica;
} <span style="color: #FBDE2D;">else</span> {
    nekajtretjega;
}
</pre>
</div>

<div class="org-src-container">

<pre class="src src-php"><span style="color: #FBDE2D;">if</span> (pogoj):
    razne;
    stvari;
<span style="color: #FBDE2D;">else</span>:
    drugo;
<span style="color: #FBDE2D;">endif</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-4-2" class="outline-4">
<h4 id="sec-2-4-2"><span class="section-number-4">2.4.2</span> While zanke</h4>
<div class="outline-text-4" id="text-2-4-2">
<div class="org-src-container">

<pre class="src src-php"><span style="color: #FBDE2D;">while</span> (pogoj) {
    ponavljaj;
}
</pre>
</div>

<div class="org-src-container">

<pre class="src src-php"><span style="color: #FBDE2D;">do</span> {
    ponavljaj;
} <span style="color: #FBDE2D;">while</span> (pogoj);
</pre>
</div>

<div class="org-src-container">

<pre class="src src-php"><span style="color: #FBDE2D;">while</span> (pogoj):
    ponavljaj;
<span style="color: #FBDE2D;">endwhile</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-4-3" class="outline-4">
<h4 id="sec-2-4-3"><span class="section-number-4">2.4.3</span> For zanke</h4>
<div class="outline-text-4" id="text-2-4-3">
<div class="org-src-container">

<pre class="src src-php"><span style="color: #FBDE2D;">for</span> (<span style="color: #d3d3d3; background-color: #000000;">$</span><span style="color: #D8FA3C;">i</span> = 0; <span style="color: #d3d3d3; background-color: #000000;">$</span><span style="color: #D8FA3C;">i</span> &lt; 3; <span style="color: #d3d3d3; background-color: #000000;">$</span><span style="color: #D8FA3C;">i</span>++) {
    ponovi;     <span style="color: #8e908c; font-style: italic;">// </span><span style="color: #8B8989; font-style: italic;">Ponovi 3x</span>
}
</pre>
</div>

<div class="org-src-container">

<pre class="src src-php"><span style="color: #d3d3d3; background-color: #000000;">$</span><span style="color: #D8FA3C;">stevec</span> = [1, 2, 3, 4];
<span style="color: #FBDE2D;">foreach</span> (<span style="color: #d3d3d3; background-color: #000000;">$</span><span style="color: #D8FA3C;">stevec</span> <span style="color: #FBDE2D;">as</span> <span style="color: #d3d3d3; background-color: #000000;">$</span><span style="color: #D8FA3C;">stevilo</span>) {
    <span style="color: #FBDE2D;">echo</span>(<span style="color: #61CE3C;">"</span><span style="color: #D8FA3C;">$stevilo</span><span style="color: #61CE3C;">!\n"</span>);
}
</pre>
</div>

<div class="org-src-container">

<pre class="src src-php"><span style="color: #d3d3d3; background-color: #000000;">$</span><span style="color: #D8FA3C;">polje</span> = [
    <span style="color: #61CE3C;">"kljuc"</span> =&gt; <span style="color: #61CE3C;">"vrednost"</span>,
    <span style="color: #61CE3C;">"drugo"</span> =&gt; <span style="color: #61CE3C;">"tretje"</span>
];
<span style="color: #FBDE2D;">foreach</span> (<span style="color: #d3d3d3; background-color: #000000;">$</span><span style="color: #D8FA3C;">polje</span> <span style="color: #FBDE2D;">as</span> <span style="color: #d3d3d3; background-color: #000000;">$</span><span style="color: #D8FA3C;">kljuc</span> =&gt; <span style="color: #d3d3d3; background-color: #000000;">$</span><span style="color: #D8FA3C;">vrednost</span>) {
    <span style="color: #FBDE2D;">echo</span>(<span style="color: #61CE3C;">"vrednost "</span> . <span style="color: #d3d3d3; background-color: #000000;">$</span><span style="color: #D8FA3C;">kljuc</span> . <span style="color: #61CE3C;">": "</span> . <span style="color: #d3d3d3; background-color: #000000;">$</span><span style="color: #D8FA3C;">vrednost</span> . <span style="color: #61CE3C;">"\n"</span>);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-4-4" class="outline-4">
<h4 id="sec-2-4-4"><span class="section-number-4">2.4.4</span> Switch stavek</h4>
<div class="outline-text-4" id="text-2-4-4">
<ul class="org-ul">
<li>Podoben if / elseif / else, ampak nekoliko berljivejši
</li>
</ul>

<div class="org-src-container">

<pre class="src src-php"><span style="color: #FBDE2D;">switch</span> (<span style="color: #d3d3d3; background-color: #000000;">$</span><span style="color: #D8FA3C;">spremenljivka</span>) {
    <span style="color: #FBDE2D;">case</span> 1:
        narediNekaj();
        <span style="color: #FBDE2D;">break</span>;
    <span style="color: #FBDE2D;">case</span> <span style="color: #61CE3C;">"drugo"</span>:
        drug_primer();
        <span style="color: #FBDE2D;">break</span>;
    <span style="color: #FBDE2D;">default</span>:
        privzeto();
}
</pre>
</div>
</div>
</div>
</div>
