delegator/delavnica.org
** Funkcije
     #+BEGIN_SRC php
     function imeFunkcije ($argument, &$referencniArgument) {
         telo_funkcije;
         $vrednost = "primer";
         return $vrednost;
     }
     #+END_SRC

     #+BEGIN_SRC php
     function sestej ($prvo, $drugo, $neobvezno = 0) {
         return $prvo + $drugo + 2;
     }
     sestej(2, 3);    // Vrne 7
     sestej(2, 3, 5); // Vrne 12
     #+END_SRC

** Seznam primerov raznih PHP funkcij
 - [[http://php.net/manual/en/function.substr.php][Povezava do seznama
   funkcij]]

 - implode($veznik, $polje)

   Združi elemente polja z znakom $veznik

   #+BEGIN_SRC php
   $polje = ["Janez", "Marija", "Ana", "Zdravko"];
   echo(implode(", ", $polje));   // "Janez, Marija, Ana, Zdravko"
   #+END_SRC

 - explode($locilo, $niz[, $meja])

   Razstavi niz znakov v polje elementov, ki so med seboj ločeni z
   znakom/znaki $locilo. Število elementov lahko po želji omejimo z $meja

   #+BEGIN_SRC php
   $niz = "Kadar spimo|Lep dan|tretje";
   echo(explode("|", $niz, 2));   // ["Kadar spimo", "Lep dan|tretje"]
   #+END_SRC

 - strpos($niz, $iskano[, $zamik])

   Poišče prvo pojavitev znaka/niza $iskano v znakovnem nizu $niz, lahko pa
   tudi podamo zanim, po katerem začne iskati.

 - strtoupper($niz)

   Spremeni niz v velike črke

 - strtolower($niz)

   Spremeni niz v male črke

 - count($spremenljivka)

   Vrne dolžino za vrednost $spremenljivka. Če gre za niz, vrne število
   znakov, pri polju pa število elementov

 - substr($niz, $zacetek[, $dolzina])

   Vrne podniz zankovnega niza $niz, od položaja $zacetek do konca, če pa
   podamo $dolzina, pa le toliko znakov

 - die([$sporocilo]);

   Končaj izvajanje programa, kjer je to klicano. Lahko podamo tudi
   sporočilo, ki se izpiše pred izhodom

* git

Git je sistem za nadzor nad verzijami projekta. In seveda še mnogo več. Med drugim je tudi izjemno orodje za sodelovanje.

 - [[https://www.atlassian.com/git/][git tutorial]]

 - [[http://git-scm.com/download/guis][GUIclients]]

** Začetni ukazi
   - ~git init~ :: ustvari nov git repository (git arhiv)
   - ~git clone <repo>~ :: kopira obstoječ git arhiv
   - ~git config~ :: podatki uporabnika
 
*** Shranjevanje
   - ~git add <datoteke>~ :: dodajanje datotek, ki bodo vključene v naslednji commit (verzija)
   - ~git commit -m "<komentar>"~ :: zapiše izbrane spremembe v zgodovino projekta - ta zgodovina je shranjena lokalno
        
*** Pregledovanje arhiva
   - ~git status~ :: prikaže stanje v delovni mapi in spremembe v njej
   - ~git log~ :: prikaže zgodovino projekta

   - ~git checkout~ :: 3 načini uporabe
     + ~git checkout <ime_veje>~ :: pojdi v vejo
     + ~git checkout <commit> <ime_datoteke>~ :: poglej prejšno verzije datoteke
     + ~git checkout <commit>~ :: Posodobi vse datoteke, da ustrezajo izbranemu komitu

#+begin_src ditaa :file dita-seqboxes0.png
/-------\     /-------\     /-------\    /-------\     /-------\          /-------\
|       |     |       |     |       |    |       |     |       |          |       |
| v1    +-----+ v2    +-----+ v3    +----+ v4    +-----+ v5    +----------+ v6    | 
\-------/     \-------/     \-------/    \-------/     \-------/          \-------/
#+end_src

*** Razveljavljanje sprememb /(ne znam)/
   - ~git checkout~ 
   - ~git revert~ 
   - ~git reset~ 
   - ~git clean~ 
   - ~git commit --amend~ 
   - ~git rebase~ 

** Sodelovanje
   Za skupno delo na projektu je potrebno dodati povezavo do oddaljenjega arhiva (remote). Ta lahko poteka preko HTTP(S)
   protokola ali ssh.
   - ~git remote~ :: ukaz za ustvarjanje, ogled in brisanje povezov do drugih arhivov
     + ~git remote -v~ :: prikaže povezave do drugih arhivov
     + ~git remote add <ime_povezave> <url>~ :: ustvari povezavo do oddaljenega arhiva
          Url je lahko ~http~ ali ~ssh~ povezava. Slednja ima prednost lažjega zapisovnja, al kaj.
     + ~git remote rm <ime_povezave>~ :: izbriše povezavo
     + ~git remote rename <staro_ime> <novo_ime>~ :: preimenuje povezavo
   - ~git fetch~ :: uvozi zgodovino commitov /(ne znam)/
