delegator/delavnica.html

<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> Funkcije</h3>
<div class="outline-text-3" id="text-2-5">
<div class="org-src-container">

<pre class="src src-php"><span style="color: #FBDE2D;">function</span> <span style="color: #ff1493;">imeFunkcije</span> (<span style="color: #d3d3d3; background-color: #000000;">$</span><span style="color: #D8FA3C;">argument</span>, &amp;<span style="color: #d3d3d3; background-color: #000000;">$</span><span style="color: #D8FA3C;">referencniArgument</span>) {
    telo_funkcije;
    <span style="color: #d3d3d3; background-color: #000000;">$</span><span style="color: #D8FA3C;">vrednost</span> = <span style="color: #61CE3C;">"primer"</span>;
    <span style="color: #FBDE2D;">return</span> <span style="color: #d3d3d3; background-color: #000000;">$</span><span style="color: #D8FA3C;">vrednost</span>;
}
</pre>
</div>

<div class="org-src-container">

<pre class="src src-php"><span style="color: #FBDE2D;">function</span> <span style="color: #ff1493;">sestej</span> (<span style="color: #d3d3d3; background-color: #000000;">$</span><span style="color: #D8FA3C;">prvo</span>, <span style="color: #d3d3d3; background-color: #000000;">$</span><span style="color: #D8FA3C;">drugo</span>, <span style="color: #d3d3d3; background-color: #000000;">$</span><span style="color: #D8FA3C;">neobvezno</span> = 0) {
    <span style="color: #FBDE2D;">return</span> <span style="color: #d3d3d3; background-color: #000000;">$</span><span style="color: #D8FA3C;">prvo</span> + <span style="color: #d3d3d3; background-color: #000000;">$</span><span style="color: #D8FA3C;">drugo</span> + 2;
}
sestej(2, 3);    <span style="color: #8e908c; font-style: italic;">// </span><span style="color: #8B8989; font-style: italic;">Vrne 7</span>
sestej(2, 3, 5); <span style="color: #8e908c; font-style: italic;">// </span><span style="color: #8B8989; font-style: italic;">Vrne 12</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> Seznam primerov raznih PHP funkcij</h3>
<div class="outline-text-3" id="text-2-6">
<ul class="org-ul">
<li><a href="http://php.net/manual/en/function.substr.php">Povezava do seznama
funkcij</a>
</li>

<li>implode($veznik, $polje)

<p>
Združi elemente polja z znakom $veznik
</p>

<div class="org-src-container">

<pre class="src src-php"><span style="color: #d3d3d3; background-color: #000000;">$</span><span style="color: #D8FA3C;">polje</span> = [<span style="color: #61CE3C;">"Janez"</span>, <span style="color: #61CE3C;">"Marija"</span>, <span style="color: #61CE3C;">"Ana"</span>, <span style="color: #61CE3C;">"Zdravko"</span>];
<span style="color: #FBDE2D;">echo</span>(implode(<span style="color: #61CE3C;">", "</span>, <span style="color: #d3d3d3; background-color: #000000;">$</span><span style="color: #D8FA3C;">polje</span>));   <span style="color: #8e908c; font-style: italic;">// </span><span style="color: #8B8989; font-style: italic;">"Janez, Marija, Ana, Zdravko"</span>
</pre>
</div>
</li>

<li>explode($locilo, $niz[, $meja])

<p>
Razstavi niz znakov v polje elementov, ki so med seboj ločeni z
znakom/znaki $locilo. Število elementov lahko po želji omejimo z $meja
</p>

<div class="org-src-container">

<pre class="src src-php"><span style="color: #d3d3d3; background-color: #000000;">$</span><span style="color: #D8FA3C;">niz</span> = <span style="color: #61CE3C;">"Kadar spimo|Lep dan|tretje"</span>;
<span style="color: #FBDE2D;">echo</span>(explode(<span style="color: #61CE3C;">"|"</span>, <span style="color: #d3d3d3; background-color: #000000;">$</span><span style="color: #D8FA3C;">niz</span>, 2));   <span style="color: #8e908c; font-style: italic;">// </span><span style="color: #8B8989; font-style: italic;">["Kadar spimo", "Lep dan|tretje"]</span>
</pre>
</div>
</li>

<li>strpos($niz, $iskano[, $zamik])

<p>
Poišče prvo pojavitev znaka/niza $iskano v znakovnem nizu $niz, lahko pa
tudi podamo zanim, po katerem začne iskati.
</p>
</li>

<li>strtoupper($niz)

<p>
Spremeni niz v velike črke
</p>
</li>

<li>strtolower($niz)

<p>
Spremeni niz v male črke
</p>
</li>

<li>count($spremenljivka)

<p>
Vrne dolžino za vrednost $spremenljivka. Če gre za niz, vrne število
znakov, pri polju pa število elementov
</p>
</li>

<li>substr($niz, $zacetek[, $dolzina])

<p>
Vrne podniz zankovnega niza $niz, od položaja $zacetek do konca, če pa
podamo $dolzina, pa le toliko znakov
</p>
</li>

<li>die([$sporocilo]);

<p>
Končaj izvajanje programa, kjer je to klicano. Lahko podamo tudi
sporočilo, ki se izpiše pred izhodom
</p>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> git</h2>
<div class="outline-text-2" id="text-3">
<p>
Git je sistem za nadzor nad verzijami projekta. In seveda še mnogo več. Med drugim je tudi izjemno orodje za sodelovanje.
</p>

<ul class="org-ul">
<li><a href="https://www.atlassian.com/git/">git tutorial</a>
</li>

<li><a href="http://git-scm.com/download/guis">GUIclients</a>
</li>
</ul>
</div>

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Začetni ukazi</h3>
<div class="outline-text-3" id="text-3-1">
<dl class="org-dl">
<dt> <code>git init</code> </dt><dd>ustvari nov git repository (git arhiv)
</dd>
<dt> <code>git clone &lt;repo&gt;</code> </dt><dd>kopira obstoječ git arhiv
</dd>
<dt> <code>git config</code> </dt><dd>podatki uporabnika
</dd>
</dl>
</div>

<div id="outline-container-sec-3-1-1" class="outline-4">
<h4 id="sec-3-1-1"><span class="section-number-4">3.1.1</span> Shranjevanje</h4>
<div class="outline-text-4" id="text-3-1-1">
<dl class="org-dl">
<dt> <code>git add &lt;datoteke&gt;</code> </dt><dd>dodajanje datotek, ki bodo vključene v naslednji commit (spremembo)
</dd>
<dt> <code>git commit &lt;datoteke&gt;</code> </dt><dd>zapiše izbrane spremembe v zgodovino projekta - ta zgodovina je shranjena lokalno
</dd>
</dl>
</div>
</div>

<div id="outline-container-sec-3-1-2" class="outline-4">
<h4 id="sec-3-1-2"><span class="section-number-4">3.1.2</span> Pregledovanje arhiva</h4>
<div class="outline-text-4" id="text-3-1-2">
<dl class="org-dl">
<dt> <code>git status</code> </dt><dd>prikaže stanje v delovni mapi in spremembe v njej
</dd>
<dt> <code>git log</code> </dt><dd>prikaže zgodovino projekta
</dd>
<dt> <code>git checkout</code> </dt><dd>3 načini uporabe
<dl class="org-dl">
<dt> <code>git checkout &lt;ime_veje&gt;</code> </dt><dd>pojdi v vejo
</dd>
<dt> <code>git checkout &lt;commit&gt; &lt;ime_datoteke&gt;</code> </dt><dd>poglej prejšno verzije datoteke
</dd>
<dt> <code>git checkout &lt;commit</code> </dt><dd>Posodobi vse datoteke, da ustrezajo izbranemu komitu
</dd>
</dl>
</dd>
</dl>

<div class="org-src-container">

<pre class="src src-ditaa">/-------\     /-------\     /-------\    /-------\     /-------\          /-------\
|       |     |       |     |       |    |       |     |       |          |       |
| v1    +-----+ v2    +-----+ v3    +----+ v4    +-----+ v5    +----------+ v6    | 
\-------/     \-------/     \-------/    \-------/     \-------/          \-------/
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-1-3" class="outline-4">
<h4 id="sec-3-1-3"><span class="section-number-4">3.1.3</span> Razveljavljanje sprememb <i>(ne znam)</i></h4>
<div class="outline-text-4" id="text-3-1-3">
<ul class="org-ul">
<li><code>git checkout</code> 
</li>
<li><code>git revert</code> 
</li>
<li><code>git reset</code> 
</li>
<li><code>git clean</code> 
</li>
<li><code>git commit --amend</code> 
</li>
<li><code>git rebase</code> 
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Sodelovanje</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Za skupno delo na projektu je potrebno dodati povezavo do oddaljenjega arhiva. Ta lahko poteka preko HTTP(S)
protokola ali ssh.
</p>
<dl class="org-dl">
<dt> <code>git remote</code> </dt><dd>ukaz za ustvarjanje, ogled in brisanje povezov do drugih arhivov
<dl class="org-dl">
<dt> <code>git remote -v</code> </dt><dd>prikaže povezave do drugih arhivov
</dd>
<dt> <code>git remote add &lt;ime_povezave&gt; &lt;url&gt;</code> </dt><dd>ustvari povezavo do oddaljenega arhiva
Url je lahko <code>http</code> ali <code>ssh</code> povezava. Slednja ima prednost lažjega zapisovnja, al kaj.
</dd>
<dt> <code>git remote rm &lt;ime_povezave&gt;</code> </dt><dd>izbriše povezavo
</dd>
<dt> <code>git remote rename &lt;staro_ime&gt; &lt;novo_ime&gt;</code> </dt><dd>preimenuje povezavo
</dd>
</dl>
</dd>
<dt> <code>git fetch</code> </dt><dd>uvozi zgodovino commitov <i>(ne znam)</i>
</dd>
</dl>
</div>
