delegator/delavnica.html
<div id="outline-container-sec-3-2-1" class="outline-4">
<h4 id="sec-3-2-1"><span class="section-number-4">3.2.1</span> Porivanje in vlečenje</h4>
<div class="outline-text-4" id="text-3-2-1">
<dl class="org-dl">
<dt> <code>git pull &lt;remote&gt;</code> </dt><dd>združi vodilne spremembe iz oddaljenega arhiva v lokalni/delovni arhiv
<dl class="org-dl">
<dt> <code>git pull --rebase</code> </dt><dd>združi spremembe iz oddaljenega arhiva glede na čas commitov 
</dd>
</dl>
</dd>
<dt> <code>git push &lt;remote&gt; &lt;ime_veje&gt;</code> </dt><dd>prenos lokalnih sprememb na oddaljen arhiv
</dd>
</dl>
<div class="org-src-container">

<pre class="src src-ditaa">             +-----------+
             | cBLU      |
             | Origin/m  |
             +----+------+
                  | 
                  | 
/-------\     /---+---\     /-------\    /-------\     /-------\
|       |     |       |     |       |    |       |     |       |
| v1    +-----+ v2    +-----+ v3    +----+ v4    +-----+ v5    | 
\-------/     \-------/     \-------/    \-------/     \---+---/
                                                           |
                                                           |
                                                      +----+------+
                                                      | cBLU      |
                                                      | m         |
                                                      +-----------+
</pre>
</div>

<div class="org-src-container">

<pre class="src src-ditaa">                                                    +-----------+
                                                    | cBLU      |
                                                    | Origin/m  |
                                                    +------+----+
                                                           |
                                                           |
/-------\     /---+---\     /-------\    /-------\     /---+---\     
|       |     |       |     |       |    |       |     |       |
| v1    +-----+ v2    +-----+ v3    +----+ v4    +-----+ v5    |
\-------/     \-------/     \-------/    \-------/     \---+---/
                                                           |
                                                           |
                                                      +----+------+
                                                      | cBLU      |
                                                      | m         |
                                                      +-----------+
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-2-2" class="outline-4">
<h4 id="sec-3-2-2"><span class="section-number-4">3.2.2</span> Veje</h4>
<div class="outline-text-4" id="text-3-2-2">
<p>
So neodvisne razvojne linije projekta. Novi komiti so shranjeni v zgodovino trenutne veje. 
</p>
<dl class="org-dl">
<dt> <code>git branch</code> </dt><dd>ukaz lahko ustvari, prikaže, preimenuje in izbriše veje. Za preskakovanje med vejami se uporablja <code>git checkout</code>.
<dl class="org-dl">
<dt> <code>git branch</code> </dt><dd>prikaže vse veje v arhivu
</dd>
<dt> <code>git branch &lt;ime_veje&gt;</code> </dt><dd>ustvari novo vejo, a se ne premakne v njo
</dd>
<dt> <code>git branch -d &lt;ime_veje&gt;</code> </dt><dd>izbriše vejo
</dd>
<dt> <code>git branch - &lt;ime_veje&gt;</code> </dt><dd>preimenuje trenutno vejo
</dd>
</dl>
</dd>
</dl>
<p>
Veje so sestavni del gitovega razvojnega procesa. Spremembe na projektu se najprej naredi v stranskih vejah. Ko je koda v stranski
veji stabilna, se jo lahko združi (merge-a) v glavno vejo. 
</p>
<dl class="org-dl">
<dt> <code>git checkout &lt;ime_veje&gt;</code> </dt><dd>odpre že obstoječo vejo (prej je morala biti ustvarjena z <code>git branc</code>)
</dd>
<dt> <code>git checkout -b &lt;ime_nove_veje&gt;</code> </dt><dd>združi z ukazom za ustvarjanje nove veje
</dd>
</dl>
</div>
<ol class="org-ol"><li><a id="sec-3-2-2-1" name="sec-3-2-2-1"></a>Združevanje (merge)<br  /><div class="outline-text-5" id="text-3-2-2-1">
<p>
Je način, kako nazaj združimo razdeljeno zgodovino. Vse spremembe se zapišejo v trenutno/izbrano vejo.
</p>
<dl class="org-dl">
<dt> <code>git merge &lt;ime_veje&gt;</code> </dt><dd>spremembe izbrane veje se zapišejo v trenutno vejo
</dd>
</dl>
<p>
Če se v združevanih vejah niso urejale iste stvari, potem ne pride do konfliktov in veji se združita hitro. Ako pa so se spreminjale
iste stvari v združevanih vejah, dobimo spore, ki jih je potrebno razrešiti. Dobimo <b>tro-vejno združevanje</b>, saj se za združevanje 
uporabljajo trije komiti - vodilna komita iz vsake veje in njunega skupnega prednika.
</p>

<div class="org-src-container">

<pre class="src src-ditaa">/-------\     /-------\     /-------\    /-------\     /-------\          /-------\
|       |     |       |     |       |    |       |     |       |          |       |
| v1    +-----+ v2    +--+--+ v3    +----+ v4    +-----+ v5    +------+---+ v6    | 
\-------/     \-------/  |  \-------/    \-------/     \-------/      /   \-------/
                         \                                           /
                          \                                         /
                           \                                       /
                            |                                     /
                        /---+---\    /-------\                   /
                        |       |    |       |                  /
                        | newF1 +----+ newF2 +------------------+
                        \-------/    \-------/
</pre>
</div>
</div>
</li></ol>
</div>
<div id="outline-container-sec-3-2-3" class="outline-4">
<h4 id="sec-3-2-3"><span class="section-number-4">3.2.3</span> Delovni proces</h4>
<div class="outline-text-4" id="text-3-2-3">
<ol class="org-ol">
<li>koliniraš ali povlečeš projekt
</li>
<li>ustvariš novo vejo (zamisliš si neko funkcijo oz nek dodatek za k projektu)
</li>
<li>razvijaš novo vejo, dodajaš komite in potiskaš kodo v oddaljen arhiv
</li>
<li>ko si s kodo zadovoljen jo združiš z glavno vejo (pull request)
</li>
<li>spet povlečeš projekt, ustvariš novo vejo, itn.
</li>
</ol>

<p>
<a href="https://www.atlassian.com/git/tutorials/comparing-workflows/forking-workflow">workflow tutorial</a>
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> SMF</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Spremenljivke</h3>
<div class="outline-text-3" id="text-4-1">
<p>
<a href="http://wiki.simplemachines.org/smf/Global_variables">SMF variable</a>
</p>

<ul class="org-ul">
<li><code>$context</code> (predmeti/spremenljivke za v predlogo)
</li>
<li><code>$txt</code> (prevodi)
</li>
<li><code>$scripturl</code>
</li>
<li><code>$settings</code> (globalne nastavitve teme)
</li>
<li><code>$sourcedir</code> (absolutna pot do mape Sources)
</li>
<li><code>$smcFunc</code> (Funkcije)
</li>
</ul>
</div>
</div>
