delegator/delavnica.org
** Seznam SMF funkcij

    [[http://dev.simplemachines.org/smcfunctions.php][SMF Funkcije]]

    Primer klica:
    ~$smcFunc['arugment'](parameter odvisen od arugmenta)~

    Argumenti za poizvedbe v bazo:
    - ~db_query~ (SQL poizvedba) - poizvedba v bazo ~SELECT~, ~SELECT COUNT()~, ~INSERT~, ~UPDATE~, ~DELETE~
      primer: 
      #+NAME: db_query
      #+BEGIN_SRC php 
     $request = $smcFunc['db_query']('', '
            SELECT id_proj FROM {db_prefix}tasks
            WHERE id = {int:id_task}', array('id_task' => $id_task) );
      #+END_SRC
    - ~db_insert~ (SQL poizvedba)
    - ~db_fetch_assoc~ (~$request~)
      primer:
      #+NAME: db_fetch_assoc
      #+BEGIN_SRC php 
     $row = $smcFunc['db_fetch_assoc']($request);
      #+END_SRC
    - ~db_free_results~ (~$request~) - narediš kar tako, da sprostiš nek spomin, al kaj
    - ~html_specialchars~ - (~string~) zaščita pred SQL injekcijami
    - ~html_trim~ - (~string~) zaščita pred SQL injekcijami

    Ostale funckije:
     - ~checkSession()~ - preveri, če je uporabnik pravi

** Struktura Moda

    datoteke:
    - ~package-info.xml~
    - ~modification.xml~
    - ~database.php~
    - ~Delegator.php~
    - ~Delegator.template.php~
    - ~delegator_helpers.php~    
    - ~delegator.js~
    - ~moment.min.js~
    - ~pikaday.css~    
    - ~pikaday.jquery.js~
    - ~pikaday.js~    

*** Povezave
     - [[http://www.simplemachines.org/community/index.php?topic=299670.0][modification.xml]]
     - [[http://www.simplemachines.org/community/index.php?topic=299669.0][package-info.xml]] 
     - [[http://wiki.simplemachines.org/smf/Coding_Guidelines][Smernice programiranja]]
     - [[http://wiki.simplemachines.org/smf/Customization_approval_guidelines][Smernice za kostumizacijo]]
