delegator/delavnica.html

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Seznam SMF funkcij</h3>
<div class="outline-text-3" id="text-4-2">
<p>
<a href="http://dev.simplemachines.org/smcfunctions.php">SMF Funkcije</a>
</p>

<p>
Primer klica:
<code>$smcFunc['arugment'](parameter odvisen od arugmenta)</code>
</p>

<p>
Argumenti za poizvedbe v bazo:
</p>
<ul class="org-ul">
<li><code>db_query</code> (SQL poizvedba) - poizvedba v bazo <code>SELECT</code>, <code>SELECT COUNT()</code>, <code>INSERT</code>, <code>UPDATE</code>, <code>DELETE</code>
      primer: 
<div class="org-src-container">

<pre class="src src-php" id="db_query"><span style="color: #d3d3d3; background-color: #000000;">$</span><span style="color: #D8FA3C;">request</span> = <span style="color: #d3d3d3; background-color: #000000;">$</span><span style="color: #D8FA3C;">smcFunc</span>[<span style="color: #61CE3C;">'db_query'</span>](<span style="color: #61CE3C;">''</span>, <span style="color: #61CE3C;">'</span>
<span style="color: #61CE3C;">       SELECT id_proj FROM {db_prefix}tasks</span>
<span style="color: #61CE3C;">       WHERE id = {int:id_task}'</span>, <span style="color: #FBDE2D;">array</span>(<span style="color: #61CE3C;">'id_task'</span> =&gt; <span style="color: #d3d3d3; background-color: #000000;">$</span><span style="color: #D8FA3C;">id_task</span>) );
</pre>
</div>
</li>
<li><code>db_insert</code> (SQL poizvedba)
</li>
<li><code>db_fetch_assoc</code> (<code>$request</code>)
primer:
<div class="org-src-container">

<pre class="src src-php" id="db_fetch_assoc"><span style="color: #d3d3d3; background-color: #000000;">$</span><span style="color: #D8FA3C;">row</span> = <span style="color: #d3d3d3; background-color: #000000;">$</span><span style="color: #D8FA3C;">smcFunc</span>[<span style="color: #61CE3C;">'db_fetch_assoc'</span>](<span style="color: #d3d3d3; background-color: #000000;">$</span><span style="color: #D8FA3C;">request</span>);
</pre>
</div>
</li>
<li><code>db_free_results</code> (<code>$request</code>) - narediš kar tako, da sprostiš nek spomin, al kaj
</li>
<li><code>html_specialchars</code> - (<code>string</code>) zaščita pred SQL injekcijami
</li>
<li><code>html_trim</code> - (<code>string</code>) zaščita pred SQL injekcijami
</li>
</ul>

<p>
Ostale funckije:
</p>
<ul class="org-ul">
<li><code>checkSession()</code> - preveri, če je uporabnik pravi
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> Struktura Moda</h3>
<div class="outline-text-3" id="text-4-3">
<p>
datoteke:
</p>
<ul class="org-ul">
<li><code>package-info.xml</code>
</li>
<li><code>modification.xml</code>
</li>
<li><code>database.php</code>
</li>
<li><code>Delegator.php</code>
</li>
<li><code>Delegator.template.php</code>
</li>
<li><code>delegator_helpers.php</code>    
</li>
<li><code>delegator.js</code>
</li>
<li><code>moment.min.js</code>
</li>
<li><code>pikaday.css</code>    
</li>
<li><code>pikaday.jquery.js</code>
</li>
<li><code>pikaday.js</code>    
</li>
</ul>
</div>

<div id="outline-container-sec-4-3-1" class="outline-4">
<h4 id="sec-4-3-1"><span class="section-number-4">4.3.1</span> Povezave</h4>
<div class="outline-text-4" id="text-4-3-1">
<ul class="org-ul">
<li><a href="http://www.simplemachines.org/community/index.php?topic=299670.0">modification.xml</a>
</li>
<li><a href="http://www.simplemachines.org/community/index.php?topic=299669.0">package-info.xml</a> 
</li>
<li><a href="http://wiki.simplemachines.org/smf/Coding_Guidelines">Smernice programiranja</a>
</li>
<li><a href="http://wiki.simplemachines.org/smf/Customization_approval_guidelines">Smernice za kostumizacijo</a>
</li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: len</p>
<p class="date">Created: 2015-04-19 Sun 14:34</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
